01 application-record.
    05 application-key            pic x(64).
    05 application-username       pic x(32).
    05 application-job-key        pic x(200).
    05 application-job-title     pic x(100).
    05 application-employer      pic x(100).
    05 application-location      pic x(100).
    05 application-id             pic 9(9) comp-5.
