       01 connection-record.
           05 connection-key         pic x(204).
           05 connection-recipient   pic x(100).
           05 connection-sender      pic x(100).
