       01 connection-record.
           05 connection-key         pic x(204).
           05 connection-user-1   pic x(100).
           05 connection-user-2      pic x(100).
