       01 job-record.
           *> 05 job-id pic want this to be some number
           *> Key = Creator + Title
           05 job-key pic x(200).
           05 job-creator pic x(100).
           05 job-title pic x(100).
           05 job-description pic x(200).
           05 job-employer pic x(100).
           05 job-location pic x(100).
           05 job-salary pic x(100).
